In [ ]:
!pip install pandas

In [ ]:
import pandas as pd

# series

In [30]:
## Creating empty series
d=pd.Series()
d

Series([], dtype: object)

In [31]:
type(d)

pandas.core.series.Series

In [32]:
## Creating series with one element
d=pd.Series(17)

In [18]:
d

0    17
dtype: int64

In [19]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)

In [20]:
d

0    10
1    11
2    12
dtype: int64

In [21]:
##  creating series using list
d=pd.Series([45,78,56,44.5,78])

In [22]:
d

0    45.0
1    78.0
2    56.0
3    44.5
4    78.0
dtype: float64

In [23]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3.7,4])
d1=pd.Series(arr)
d1

0    1.0
1    2.0
2    3.7
3    4.0
dtype: float64

In [24]:
# Extract 3.7 from variable d1
d1[2]

3.7

In [25]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [26]:
arr2

array([[1, 2],
       [3, 4],
       [5, 6]])

In [33]:
s2 = pd.Series(arr2)

ValueError: Data must be 1-dimensional, got ndarray of shape (3, 2) instead

In [28]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [29]:
d.values() #To see the Values of a Dictionary

dict_values([1, 2, 3, 4])

In [ ]:
d.keys() #To see the Keys of a Dictionary

In [ ]:
b=pd.Series(d)
b

In [ ]:
#Extracting elements out from a series
#b["d"] 
b[3]

In [ ]:
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d

In [ ]:
#Task: Extract 47,289,78,1,47
d[[4,13,15,0,4]] #Multiple index

In [ ]:
## Slicing operation
d[5:11]

In [ ]:
d[0]=100  ## changing the element

In [ ]:
d

In [28]:
d[6:10]=[100,200,300,400]

In [29]:
d

0     100
1       2
2       3
3       5
4      47
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [30]:
arr3=np.array([1,2,4.2,"Six"])
s=pd.Series(arr3,index=['one','Two','Three','Four'])   
s

one        1
Two        2
Three    4.2
Four     Six
dtype: object

In [31]:
#Checking the datatype of variable
type(s)

pandas.core.series.Series

In [32]:
#Checking the datatype of elements
s.dtype

dtype('O')

# DataFrame

In [33]:
## empty dataframe
d=pd.DataFrame()
d

Empty DataFrame
Columns: []
Index: []

In [34]:
type(d)

pandas.core.frame.DataFrame

In [41]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['klm','a']]

In [42]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['hij'], ['klm', 'a']]

In [46]:
d=pd.DataFrame(data)
d

     0     1
0  abc     1
1  def     2
2  ghi     3
3  hij  None
4  klm     a

In [48]:
d=pd.DataFrame(data,columns=['A','B']) ## changing the column 
d

     A     B
0  abc     1
1  def     2
2  ghi     3
3  hij  None
4  klm     a

In [50]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index
d

     A     B
A  abc     1
B  def     2
C  ghi     3
D  hij  None
E  klm     a

In [52]:
d=pd.DataFrame(data,columns=['Name','Roll Number'])
d

  Name Roll Number
0  abc           1
1  def           2
2  ghi           3
3  hij        None
4  klm           a

In [70]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}
print(type(data))
data

<class 'dict'>

{'name': ['a', 'b', 'c', 'd', 'e', 'f'], 'age': [45, 12, 48, 25, 12, 56]}

In [72]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [73]:
d=pd.DataFrame(data, index=['A','B','C','D','E','F'])
d

  name  age
A    a   45
B    b   12
C    c   48
D    d   25
E    e   12
F    f   56

In [85]:
d.rename({'Name':'Candidate','Age':'Age_years'},axis=1,inplace=True)
d

  Candidate  Age_years  Subject
0      Alex         10    Maths
1       Bob         12  Science
2     Kelly         15      Eco
3     Boris         14      Geo
4       Ken         18  English

In [86]:
## Accessing the elements from dataframe
data=[['Alex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]
data

[['Alex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [87]:
d=pd.DataFrame(data,columns=['Name','Age','Subject'])
d

    Name  Age  Subject
0   Alex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [88]:
## accessing one single column
d['Subject'] #d.Name  #Its a Series

0      Maths
1    Science
2        Eco
3        Geo
4    English
Name: Subject, dtype: object

In [89]:
## accessing Multiple column
#Extract: Subject,Name,Age
d[["Subject","Name","Age"]]

   Subject   Name  Age
0    Maths   Alex   10
1  Science    Bob   12
2      Eco  Kelly   15
3      Geo  Boris   14
4  English    Ken   18

In [90]:
d

    Name  Age  Subject
0   Alex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [91]:
d.iloc[[0],0:]

   Name  Age Subject
0  Alex   10   Maths

In [92]:
d.iloc[[3,1],[1,0]]

   Age   Name
3   14  Boris
1   12    Bob

In [97]:
d.iloc[1,2]='social science'

In [98]:
d

    Name  Age         Subject
0   Alex   10           Maths
1    Bob   12  social science
2  Kelly   15             Eco
3  Boris   14             Geo
4    Ken   18         English

In [99]:
d.iloc[0,0] ="ALAN"  # changing an element

In [100]:
d

    Name  Age         Subject
0   ALAN   10           Maths
1    Bob   12  social science
2  Kelly   15             Eco
3  Boris   14             Geo
4    Ken   18         English

In [101]:
d['Gender'] = "Male"  # initialize and add a new column to the DataFrame

In [102]:
d

    Name  Age         Subject Gender
0   ALAN   10           Maths   Male
1    Bob   12  social science   Male
2  Kelly   15             Eco   Male
3  Boris   14             Geo   Male
4    Ken   18         English   Male

In [103]:
d['Age'] = d['Age'] - 1   # d['Age']-=1
d

    Name  Age         Subject Gender
0   ALAN    9           Maths   Male
1    Bob   11  social science   Male
2  Kelly   14             Eco   Male
3  Boris   13             Geo   Male
4    Ken   17         English   Male

In [115]:
d.iloc[:2,[0,1]] # Index location

   Name  Age
0  ALAN    9
1   Bob   11

In [117]:
d.iloc[[1,2],[0,1]]  # [row,col]

    Name  Age
1    Bob   11
2  Kelly   14

In [118]:
d.iloc[1:3,[0,1]]

    Name  Age
1    Bob   11
2  Kelly   14

In [119]:
d.iloc[[1]]  # access row 1

  Name  Age         Subject Gender
1  Bob   11  social science   Male

In [120]:
pwd

'C:\\Users\\dhanu\\Desktop\\Assignment'

In [121]:
d

    Name  Age         Subject Gender
0   ALAN    9           Maths   Male
1    Bob   11  social science   Male
2  Kelly   14             Eco   Male
3  Boris   13             Geo   Male
4    Ken   17         English   Male

In [123]:
## to acces the single element we use iloc it will always work with index
d.iloc[1,2] ## index of row ,columns

'social science'

# loc used for locating with column names

In [124]:
d

    Name  Age         Subject Gender
0   ALAN    9           Maths   Male
1    Bob   11  social science   Male
2  Kelly   14             Eco   Male
3  Boris   13             Geo   Male
4    Ken   17         English   Male

In [125]:
## loc will work on rows as well as names of columns
d.loc[:2,['Name','Subject']]

    Name         Subject
0   ALAN           Maths
1    Bob  social science
2  Kelly             Eco

In [130]:
# Modify multiple values
d.iloc[:2,0]= ['abc','xyz'] # [0,0] , [1,0],

In [135]:
d

    Name  Age         Subject Gender
0    abc    9           Maths   Male
1    xyz   11  social science   Male
2  Kelly   14             Eco   Male
3  Boris   13             Geo   Male
4    Ken   17         English   Male

In [136]:
import pandas as pd


data = pd.DataFrame([
    ['Alex', 10, 'Maths'],
    ['Bob', 12, 'Science'],
    ['Kelly', 15, 'Eco'],
    ['Boris', 14, 'Geo'],
    ['Ken', 18, 'English']
], columns=['Name', 'Age', 'Subject'])


data.iloc[:2, 0] = ['abc', 'xyz']


data['Gender'] = 'Male'  
data.loc[data['Name'].isin(['Kelly', 'xyz']), 'Gender'] = 'Female'


print(data)

    Name  Age  Subject  Gender
0    abc   10    Maths    Male
1    xyz   12  Science  Female
2  Kelly   15      Eco  Female
3  Boris   14      Geo    Male
4    Ken   18  English    Male

In [137]:
# loc is typically used for accessing columns.

In [138]:
d['Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [139]:
d.loc[:,'Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [140]:
d

    Name  Age         Subject Gender
0    abc    9           Maths   Male
1    xyz   11  social science   Male
2  Kelly   14             Eco   Male
3  Boris   13             Geo   Male
4    Ken   17         English   Male

In [145]:
d.loc[0] ## getting the rows with singular index value

Name         abc
Age            9
Subject    Maths
Gender      Male
Name: 0, dtype: object

In [146]:
d.iloc[:,[1,2]]

   Age         Subject
0    9           Maths
1   11  social science
2   14             Eco
3   13             Geo
4   17         English

In [147]:
d.iloc[:3,1:3]

   Age         Subject
0    9           Maths
1   11  social science
2   14             Eco

In [14]:
pwd

'C:\\Users\\dhanu\\Desktop\\Assignment'

In [15]:
import pandas as pd
import numpy as np

In [16]:
## reading the data from local system.

data=pd.read_csv('C:/Users/dhanu/Desktop/Assignment/Pandas_1.ipynb')

ParserError: Error tokenizing data. C error: Expected 1 fields in line 4, saw 2